Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ96GA010.h
#define _ODCE_ODE0_POSITION                      0x00000000
#define _ODCE_ODE0_MASK                          0x00000001
#define _ODCE_ODE0_LENGTH                        0x00000001

#define _ODCE_ODE1_POSITION                      0x00000001
#define _ODCE_ODE1_MASK                          0x00000002
#define _ODCE_ODE1_LENGTH                        0x00000001

#define _ODCE_ODE2_POSITION                      0x00000002
#define _ODCE_ODE2_MASK                          0x00000004
#define _ODCE_ODE2_LENGTH                        0x00000001

#define _ODCE_ODE3_POSITION                      0x00000003
#define _ODCE_ODE3_MASK                          0x00000008
#define _ODCE_ODE3_LENGTH                        0x00000001

#define _ODCE_ODE4_POSITION                      0x00000004
#define _ODCE_ODE4_MASK                          0x00000010
#define _ODCE_ODE4_LENGTH                        0x00000001

#define _ODCE_ODE5_POSITION                      0x00000005
#define _ODCE_ODE5_MASK                          0x00000020
#define _ODCE_ODE5_LENGTH                        0x00000001

#define _ODCE_ODE6_POSITION                      0x00000006
#define _ODCE_ODE6_MASK                          0x00000040
#define _ODCE_ODE6_LENGTH                        0x00000001

#define _ODCE_ODE7_POSITION                      0x00000007
#define _ODCE_ODE7_MASK                          0x00000080
#define _ODCE_ODE7_LENGTH                        0x00000001

#define _ODCE_ODE8_POSITION                      0x00000008
#define _ODCE_ODE8_MASK                          0x00000100
#define _ODCE_ODE8_LENGTH                        0x00000001

#define _ODCE_ODE9_POSITION                      0x00000009
#define _ODCE_ODE9_MASK                          0x00000200
#define _ODCE_ODE9_LENGTH                        0x00000001

#define _ODCF_ODF0_POSITION                      0x00000000
#define _ODCF_ODF0_MASK                          0x00000001
#define _ODCF_ODF0_LENGTH                        0x00000001

#define _ODCF_ODF1_POSITION                      0x00000001
#define _ODCF_ODF1_MASK                          0x00000002
#define _ODCF_ODF1_LENGTH                        0x00000001

#define _ODCF_ODF2_POSITION                      0x00000002
#define _ODCF_ODF2_MASK                          0x00000004
#define _ODCF_ODF2_LENGTH                        0x00000001

#define _ODCF_ODF3_POSITION                      0x00000003
#define _ODCF_ODF3_MASK                          0x00000008
#define _ODCF_ODF3_LENGTH                        0x00000001

#define _ODCF_ODF4_POSITION                      0x00000004
#define _ODCF_ODF4_MASK                          0x00000010
#define _ODCF_ODF4_LENGTH                        0x00000001

#define _ODCF_ODF5_POSITION                      0x00000005
#define _ODCF_ODF5_MASK                          0x00000020
#define _ODCF_ODF5_LENGTH                        0x00000001

#define _ODCF_ODF6_POSITION                      0x00000006
#define _ODCF_ODF6_MASK                          0x00000040
#define _ODCF_ODF6_LENGTH                        0x00000001

#define _ODCF_ODF7_POSITION                      0x00000007
#define _ODCF_ODF7_MASK                          0x00000080
#define _ODCF_ODF7_LENGTH                        0x00000001

#define _ODCF_ODF8_POSITION                      0x00000008
#define _ODCF_ODF8_MASK                          0x00000100
#define _ODCF_ODF8_LENGTH                        0x00000001

#define _ODCF_ODF12_POSITION                     0x0000000C
#define _ODCF_ODF12_MASK                         0x00001000
#define _ODCF_ODF12_LENGTH                       0x00000001

#define _ODCF_ODF13_POSITION                     0x0000000D
#define _ODCF_ODF13_MASK                         0x00002000
#define _ODCF_ODF13_LENGTH                       0x00000001

#define _ODCG_ODG0_POSITION                      0x00000000
#define _ODCG_ODG0_MASK                          0x00000001
#define _ODCG_ODG0_LENGTH                        0x00000001

#define _ODCG_ODG1_POSITION                      0x00000001
#define _ODCG_ODG1_MASK                          0x00000002
#define _ODCG_ODG1_LENGTH                        0x00000001

#define _ODCG_ODG2_POSITION                      0x00000002
#define _ODCG_ODG2_MASK                          0x00000004
#define _ODCG_ODG2_LENGTH                        0x00000001

#define _ODCG_ODG3_POSITION                      0x00000003
#define _ODCG_ODG3_MASK                          0x00000008
#define _ODCG_ODG3_LENGTH                        0x00000001

#define _ODCG_ODG6_POSITION                      0x00000006
#define _ODCG_ODG6_MASK                          0x00000040
#define _ODCG_ODG6_LENGTH                        0x00000001

#define _ODCG_ODG7_POSITION                      0x00000007
#define _ODCG_ODG7_MASK                          0x00000080
#define _ODCG_ODG7_LENGTH                        0x00000001

#define _ODCG_ODG8_POSITION                      0x00000008
#define _ODCG_ODG8_MASK                          0x00000100
#define _ODCG_ODG8_LENGTH                        0x00000001

#define _ODCG_ODG9_POSITION                      0x00000009
#define _ODCG_ODG9_MASK                          0x00000200
#define _ODCG_ODG9_LENGTH                        0x00000001

#define _ODCG_ODG12_POSITION                     0x0000000C
#define _ODCG_ODG12_MASK                         0x00001000
#define _ODCG_ODG12_LENGTH                       0x00000001

#define _ODCG_ODG13_POSITION                     0x0000000D
#define _ODCG_ODG13_MASK                         0x00002000
#define _ODCG_ODG13_LENGTH                       0x00000001

#define _ODCG_ODG14_POSITION                     0x0000000E
#define _ODCG_ODG14_MASK                         0x00004000
#define _ODCG_ODG14_LENGTH                       0x00000001

#define _ODCG_ODG15_POSITION                     0x0000000F
#define _ODCG_ODG15_MASK                         0x00008000
#define _ODCG_ODG15_LENGTH                       0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

